# Найдите сумму цифр трехзначного числа.
# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) 

a = int(input('Введите целое число: '))
result = 0
while a:
    result += a % 10
    a = a // 10
print(result)